# PreselectionColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorOptions..::..PreselectionColor Property
ColorOptions Class See Also
---
The color of the current canvas theme used to highlight candidates for selection before they are selected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public Color PreselectionColor { get; set; }
```

Visual Basic
---
```text
Public Property PreselectionColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ PreselectionColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace